app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    @sort_by = params[:sort] || session[:sort]
    @ratings = (params[:ratings].present? ? params[:ratings].keys : @all_ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date ASC